doom/.config/doom/config.org
#+title: Config
#+OPTIONS: ':t toc:nil author:t email:t num:f
#+PROPERTY: header-args :tangle /home/joonas/.config/doom/config.el
* Information and help
Inspriation came from [[https://www.youtube.com/watch?v=ycyxytk1NAQ][protesilaos]] to start the literate org configuration. This is used with the ~literate~ flag in my doom ~init.el~, so everytime I save the page or reload my configuration, it will run ~org-babel-tangle~ to the correct files.
* Tasks
** DONE =Test= edit config :config:
CLOSED: [2025-06-02 Mon 13:10] SCHEDULED: <2025-06-02 Mon>
** DONE Figure out Iosevka Font issues :config:
CLOSED: [2025-06-02 Mon 19:27] SCHEDULED: <2025-06-03 Tue>
[[id:d8757cb2-2f84-489d-a5a7-f572dab078f4][Font Troubleshooting]]
* UI
** Font
#+begin_src emacs-lisp
;; (setq doom-font (font-spec :family "Aporetic Serif Mono" :size 16 :weight 'regular)
(setq doom-font (font-spec :family "Terminus" :size 16 :weight 'Bold)
      doom-variable-pitch-font (font-spec :family "Iosevka Comfy Duo" :size 16 :weight 'medium)
      doom-big-font (font-spec :family "Aporetic Serif" :size 24 :weight 'bold))
;; (setq doom-font "Iosevka Term-14")
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
#+end_src
** Theme
#+begin_src emacs-lisp
;; (setq doom-theme 'doom-gruvbox)
;; (setq doom-theme 'ef-duo-light)
;; (setq doom-theme 'gruvbox-dark-soft)
(setq doom-theme 'ewal-spacemacs-modern)
#+end_src
*** Toggle light and dark mode
#+begin_src emacs-lisp
(defvar my-current-theme nil
  "Stores the currently active theme for toggling.")

(defun my/my-toggle-theme ()
  "Toggle between two predefined themes. SET: leuven & leuvan dark"
  (interactive)
  (mapc #'disable-theme custom-enabled-themes) ; Disable all currently enabled themes
  (setq my-current-theme
        (if (eq my-current-theme 'ef-duo-light)
          'ef-duo-light
          'ef-duo-dark))
  (load-theme my-current-theme t)
  (message "Loaded theme: %s" my-current-theme))

(require 'ewal)
(defun my/ewal-reload-theme ()
  "Reload pywal colors and reapply ewal theme."
  (interactive)
  (ewal-load-colors)
  (load-theme 'ewal-spacemacs-modern t)
  (enable-theme 'ewal-spacemacs-modern))
#+end_src
** Leuven Specific
#+begin_src emacs-lisp
;; (setq leuven-scale-org-agenda-structure nil)
;; (setq leuven-scale-org-document-title nil)
(setq leuven-scale-outline-headlines nil)
(setq leuven-dark-scale-outline-headlines nil)
#+end_src
** Relative Line Numbers
*NOTE:* setting this to relative will break the configuration
#+begin_src emacs-lisp
(setq display-line-numbers-type 'nil)
(setq line-number-mode nil)
#+end_src
** Transparency
#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 80)  ;; 90 = 90% opaque, 10% transparent
(add-to-list 'default-frame-alist '(alpha-background . 80))
#+end_src

** Buffer Control
*** Consult
#+begin_src emacs-lisp
(setq display-buffer-alist
      '(
        ("\\*org-capture\\*"
         (display-buffer-reuse-mode-window
          display-buffer-below-selected)
         (window-height . fit-window-to-buffer)
         )))
#+end_src
*** Magit
#+begin_src emacs-lisp
(add-to-list 'display-buffer-alist
        '("\\magit:"
         (display-buffer-reuse-mode-window
          display-buffer-below-selected)
        (window-height . fit-window-to-buffer)
        (dedicated . t)))
#+end_src
** Time & Date in status bar
#+begin_src emacs-lisp
(after! doom-modeline
  ;; Customize the display to show date and time
  (setq display-time-string-forms
        '((propertize
           (concat
            " 📅 " year "/" month "/" day   ; e.g., 06/05/2025
            " 🕘 " 24-hours ":" minutes)))) ; e.g., 20:22
  (display-time-mode 1))
#+end_src
** Leading stars
#+begin_src emacs-lisp
(setq org-hide-leading-stars t)
#+end_src
* ORG
** Directory
Setting the org directory.
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src
** Todo Sequence
#+begin_src emacs-lisp
;; (after! org
    ;; (setq org-todo-keywords
        ;; '((sequence "TODO" "WAIT" "|" "DONE" "CANCELED"))))
#+end_src
** Emphasis Markers
Hiding the markers for *bold*, /italize/, and =highlight=.
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers t)
#+end_src
** Org-roam
*** Inital Setup
Setting up my initial templates and keybinds for org-roam.
#+begin_src emacs-lisp
;; Org Roam - setup from System Crafters Youtube
(use-package org-roam
  :ensure t
  :custom
  (org-roam-completion-everywhere t)
  (org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%H:%M %p>: %?"
       :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-capture-templates
   '(("d" "default" plain
   "%?"
   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
   :unnarrowed t)
     ("b" "book notes" plain
 "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
 :unnarrowed t)
     ("l" "programming language" plain
    "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
    :unnarrowed t)
   ("W" "watch notes" plain
 "\n* Source\n\nMake: %^{Make}\nPrice: $${Price}\nPurchased: %^{Purchased}\n\n* Additional Notes\n\n%?"
 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
 :unnarrowed t)
   ("D" "daily" plain
   "* TODO\n- [ ] %?"
   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
   :unnarrowed t)
   ("w" "weather watching" plain
    "* Details\n* Radar\n* Warnings"
   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
   :unnarrowed t)))
  :bind(("C-c n l" . org-roam-buffer-toggle)
        ("C-c n f" . org-roam-node-find)
        ("C-c n w" . org-agenda-week-view)
        ("C-c n t" . org-agenda-day-view)
        ("C-c n i" . org-roam-node-insert)
        ("C-c n d n" . org-roam-dailies-capture-today)
        ("C-c n d d" . org-roam-dailies-goto-today)
        ("C-c n d Y" . org-roam-dailies-capture-yesterday)
        ("C-c n d y" . org-roam-dailies-goto-yesterday)
        ("C-c n d T" . org-roam-dailies-capture-tomorrow)
        ("C-c n d t" . org-roam-dailies-goto-tomorrow)
        ("C-c n d c" . org-roam-dailies-goto-date)
        ("C-c n d v" . org-roam-dailies-capture-date)
        ("C-c n d b" . org-roam-dailies-goto-next-note)
        ("C-c n d f" . org-roam-dailies-goto-previous-note)
        :map org-mode-map
        ("C-c i" . completion-at-point))
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode)
  (org-roam-setup))

#+end_src
*** Org-roam UI
Org-roam UI setup to get a Obsidian graph-like view running locally.
#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

#+end_src
*** Adding to Agenda
Adding org-roam to the agenda files directory so they can be searchable.
#+begin_src emacs-lisp
(setq org-agenda-files '("~/org" "~/org-roam" "~/.config/doom"))

#+end_src
*** Backlinks
Enabling the backlinks view through org-roam, toggle with *C-c n l*.
#+begin_src emacs-lisp
(setq org-roam-mode-sections
      (list #'org-roam-backlinks-section
            #'org-roam-reflinks-section
            ;; #'org-roam-unlinked-references-section
            ))
(add-hook 'org-roam-node-visit-post-hook #'org-roam-buffer-refresh)
(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-side-window)
               (side . right)
               (slot . 0)
               (window-width . 0.33)
               (window-parameters . ((no-other-window . t)
                                     (no-delete-other-windows . t)))))
#+end_src
