doom/.config/doom/config.el
  (add-to-list 'org-capture-templates '("e" "Eating"))
  (add-to-list 'org-capture-templates
      '("eo" "eating out" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@eatingout:\n:PROPERTIES:\n:EATINGOUT: [X]\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("eb" "breakfast" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@breakfast:\n:PROPERTIES:\n:BREAKFAST: [X]\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("el" "lunch" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@lunch:\n:PROPERTIES:\n:LUNCH: [X]\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("ed" "dinner" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@dinner:\n:PROPERTIES:\n:DINNER: [X]\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("es" "snacking" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@snack:\n:PROPERTIES:\n:SNACK: [X]\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("eS" "Shopping" entry
        (file+olp+datetree "~/org/eating.org")
        "* %U %? :@shopping:\n:PROPERTIES:\n:SHOPPING: %^{What store?|%?|Staters|Sprouts}\n:END:" :kill-buffer t))
  (add-to-list 'org-capture-templates '("W" "Weather Watching"))
  (add-to-list 'org-capture-templates
      '("WW" "weather entry" entry
        (file+olp+datetree "~/org/weatherwatching.org")
        "* %U %?\n:PROPERTIES:\n:RAIN: %^{Rain?||[X]|}\n:TORNADO: %^{Tornado?||[X]}\n:HURRICANE: %^{Hurricane?||[X]}\n:END:":kill-buffer t))
  (add-to-list 'org-capture-templates '("k" "Mineral King"))
  (add-to-list 'org-capture-templates
      '("km" "Mineral Meeting" entry
        (file+headline "~/org/mk.org" "Meetings")
        "* TODO %^{Enter Mineral King Meeting: }\n SCHEDULED: %^t\n" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("kt" "Mineral Task" entry
        (file+headline "~/org/mk.org" "Tasks")
        "* TODO %^{Enter Mineral King Meeting: }\n SCHEDULED: %^t\n" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("kg" "Gig" entry
        (file+headline "~/org/mk.org" "Gigs and Events")
        "* TODO %^{Enter Mineral King Gig: }\n SCHEDULED: %^t\n" :kill-buffer t))
  (add-to-list 'org-capture-templates '("w" "Work"))
  (add-to-list 'org-capture-templates
      '("ww" "work entry" entry
        (file+datetree "~/org/work-log.org")
        "* %U %?\n%i\n%a" :kill-buffer t))
  (add-to-list 'org-capture-templates
      '("wt" "work task" entry
        (file+headline "~/org/worktasks.org" "Tasks")
        "* TODO %?\n SCHEDULED: %^t\n%i\n%a" :kill-buffer t))
  (add-to-list 'org-capture-templates
        '("wm" "Meeting" entry
          (file+olp+datetree "~/org/work-log.org")
          "* %U %^{What meeting?|%?|CRQ Meeting|SysOps Call|Joel One-on-One|RDM Weekly Agenda Touchbase|Bofa Team Discussion|RDM Team Briefings|SysOps TAR|MPS Card Readers - SOP} :@meeting: \n** Attendees\n-\n** Meetings Notes   :@note:\n-\n** Next Steps\n\n"
          :clock-in t :clock-resume t :jump-to-captured t)))

;; bold headers
(custom-set-faces!
  '(org-level-1 :inherit outline-1 :weight bold)
  '(org-level-2 :inherit outline-2 :weight bold)
  '(org-level-3 :inherit outline-3 :weight bold)
  '(org-level-4 :inherit outline-4 :weight bold))

(custom-set-faces!
  '(org-agenda-date :weight bold)
  '(org-agenda-date-today :weight bold)
  '(org-agenda-structure :weight bold)
  '(org-agenda-done :weight bold)
  '(org-agenda-todo :weight bold))

(custom-theme-set-faces
 'user
;; '(org-level-1 ((t (:height 1.25 :weight bold))))
;; '(org-level-2 ((t (:height 1.15 :weight bold))))
;; '(org-level-3 ((t (:height 1.1 :weight bold))))
;; '(org-level-4 ((t (:height 1.05 :weight bold))))
 '(org-document-title ((t (:height 1.5 :weight bold)))))

(setq org-agenda-start-with-log-mode 't)

(setq org-log-done 'time)
