doom/.config/doom/config.org
*** Super Agenda
Super agenda setup to trigger with d.
#+begin_src emacs-lisp
(setq org-M-RET-may-split-line '((default . nil)))
(setq org-insert-heading-respect-content t)
(setq org-log-into-drawer t)
(after! org
    (use-package org-super-agenda
    :ensure t
    :after org-agenda
    :init
    (setq org-agenda-skip-scheduled-if-done nil
        org-agenda-skip-deadline-if-done nil
        org-agenda-include-deadlines t
        org-agenda-block-separator nil
        org-agenda-compact-blocks t
        org-agenda-start-day nil ;; i.e. today
        org-deadline-warning-days 7
        org-agenda-start-on-weekday nil)
    (setq org-agenda-custom-commands
            '(("d" "Simple day view"
            ((agenda "" ((org-agenda-overriding-header "")
                            (org-agenda-span 1)
                            (org-super-agenda-groups
                            '((:name "Overdue"
                               :scheduled past
                               :face error)
                              (:name "💵 Bills"
                                :tag "bills")
                              (:name "🗓 Today"
                                    :time-grid t
                                    :date today
                                    :order 2)
                            (:name "Configuration"
                                    :tag "config"
                                    :order 2)
                            (:name "Done"
                                    :todo "DONE"
                                    :order 4)
                            (:discard (:anything))))))))
            ("w" "work view"
                ((tags-todo "@work"
                ((org-agenda-overriding-header "Work Stuff")
                    (org-super-agenda-groups
                    '((:name "Tasks"
                        :tag "@work")))))
                (tags-todo "@meeting"
                ((org-agenda-overriding-header "")
                    (org-super-agenda-groups
                    '((:name "Meetings"
                    :tag "@meeting")))))))
            ("i" "inbox"
            ((tags-todo "inbox"
                        ((org-agenda-overriding-header "Inbox")))))
            ("t" "to start"
            ((tags-todo "+@planning"
                        ((org-agenda-overriding-header "planning")))
            (tags-todo "-{.*}"
                        ((org-agenda-overriding-header "untagged tasks")))))
            ("p" "personal view"
                ((tags-todo "journaling"
                ((org-agenda-overriding-header "personal Stuff")
                    (org-super-agenda-groups
                    '((:name "writing"
                        :tag "journaling")))))
                (tags-todo "reading"
                ((org-agenda-overriding-header "")
                    (org-super-agenda-groups
                    '((:name "reading"
                    :tag "reading")))))
                (tags-todo "certifications"
                ((org-agenda-overriding-header "")
                    (org-super-agenda-groups
                    '((:name "certifications"
                    :tag "certifications")))))
                (tags-todo "trips"
                ((org-agenda-overriding-header "")
                    (org-super-agenda-groups
                    '((:name "trips"
                    :tag "trips")))))
                (tags-todo "@moving"
                ((org-agenda-overriding-header "" )
                    (org-super-agenda-groups
                    '((:name "moving"
                    :tag "@moving")))))))
            ("o" "Overdue tasks"
                    agenda ""
                    ((org-super-agenda-groups
                    '((:name "Overdue"
                                :and (:not (:todo "DONE")
                                        (:scheduled past))
                                :and (:not (:todo "DONE")
                                        (:deadline past)))))))
            ("q" "My QL Agenda"
                ((org-ql-block
                '(and (or (ts-active :on today)
                            (deadline auto)
                            (scheduled :to today))
                        (not (done)))
                ((org-ql-block-header "My Agenda View")
                (org-super-agenda-groups
                    '((:name "Bills" :tag "bills" :date today)
                    (:todo ("STRT" "WAIT" "CHECK" "TO-WATCH" "WATCHING") :order 7)
                    (:name "Personal" :habit t :tag "personal" :order 3)
                    (:name "Work" :tag ("@work" "@meeting" "@crq"))
                    (:todo "WAIT" :order 6)
                    (:priority "A" :order 1)
                    (:priority "B" :order 2)
                    (:priority "C" :order 2)))))))
            ("W" "Moving Tasks"
            ((org-ql-block
                '(and (tags "@moving") (not (done)))
                ((org-ql-block-header "Moving to Washington")
                (org-super-agenda-groups
                '(
                    (:name "❗High Priority" :priority "A")
                    (:name "Next Priority" :priority "B")
                    (:name "🗑Trash" :tag "@trash")
                    (:name "💸Selling" :tag "@sell")
                    (:name "📦Packing in U-box" :tag "@taking")
                    (:name "📦Packing in Car" :tag "@cars")
                    (:name "Giving away" :tag "@give")
                    (:name "✔Washington Tasks" :tag "@moving")
                    ;; Add more groups here if needed
                    (:discard (:anything t))))))))
            ("R" "Grouped by REQUESTS property"
            ((org-ql-block
                '(property "REQUESTS")
                ((org-ql-block-header "Tasks with REQUESTS property")
                (org-super-agenda-group-property-name "REQUESTS")
                (org-super-agenda-groups
                '((:auto-group t)))))))))
    :config
    (org-super-agenda-mode)))

#+end_src
*** Ignore scheduled
#+begin_src emacs-lisp
(setq org-agenda-todo-ignore-scheduled 'future)
#+end_src
*** Skip if done
#+begin_src emacs-lisp
(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-skip-deadline-if-done t)
(setq org-agenda-skip-timestamp-if-done t)
(setq org-agenda-skip-function-global
      '(org-agenda-skip-entry-if 'todo 'done))
#+end_src
*** Adding more custom
**** Requests
#+begin_src emacs-lisp
#+end_src
** Tags
#+begin_src emacs-lisp
(setq org-tag-alist
      '(
        ("@work" . ?w)
        ("@meeting" . ?m)
        ("@band" . ?b)
        ("@planning" . ?p)
        ("@reading" . ?r)
        ("@family" . ?f)
        ("@crq" . ?c)
        ("@wo" . ?W)
        ))
#+end_src
** Habits
*** Graph Column
#+begin_src emacs-lisp
(setq org-habit-graph-column 60)
#+end_src
** Exports
#+begin_src emacs-lisp
(setq org-export-with-broken-links t)
#+end_src
