doom/.config/doom/config.org
** Column View
Switching column view from slawomir-grochowski. Using *x* to switch between multiple columns
#+begin_src emacs-lisp
(defun org-columns-switch-columns ()
  (interactive)
  (save-excursion
    (org-columns-goto-top-level)
    (re-search-forward ":PROPERTIES:")
    (let* ((folded-p (org-fold-folded-p))
           (beg (re-search-forward ":COLUMNS:"))
           (end (re-search-forward ":END:"))
           (num-of-columns (count-matches ":COLUMNS:" beg end)))
      (when folded-p
        (org-fold-hide-drawer-toggle))
      (goto-char beg)
      (dotimes (_ num-of-columns)
        (org-metadown))
      (re-search-backward ":PROPERTIES:")
      (when folded-p
        (org-fold-hide-drawer-toggle))
      (org-columns))))

(with-eval-after-load 'org-colview
  (org-defkey org-columns-map "x" #'org-columns-switch-columns))

(defun my/org-columns-get-format (&optional fmt-string)
  "Return columns format specifications.
When optional argument FMT-STRING is non-nil, use it as the
current specifications.  This function also sets
`org-columns-current-fmt-compiled' and
`org-columns-current-fmt'."
  (interactive)
  (let ((format
         (or fmt-string
             (progn
               (save-excursion (re-search-forward ":COLUMNS:\\s-*.*" nil t)
                               (replace-regexp-in-string ":COLUMNS:\\s-*" ""
                                                         (buffer-substring-no-properties
                                                          (line-beginning-position) (line-end-position)))))
             (org-with-wide-buffer
              (goto-char (point-min))
              (catch :found
                (let ((case-fold-search t))
                  (while (re-search-forward "^[ \t]*#\\+COLUMNS: .+$" nil t)
                    (let ((element (org-element-at-point)))
                      (when (org-element-type-p element 'keyword)
                        (throw :found (org-element-property :value element)))))
                  nil)))
             org-columns-default-format)))
    (setq org-columns-current-fmt format)
    (org-columns-compile-format format)
    format))

(with-eval-after-load 'org
  (advice-add 'org-columns-get-format :override 'my/org-columns-get-format))
#+end_src

** Time grid
#+begin_src emacs-lisp
(setq org-agenda-time-grid
      '((daily today require-timed)
        (600 700 800 900 1000 1100 1200 1300 1400 1500 1600 1700 1800 1900 2000 2100 2200)
        "......" "----------------"))
#+end_src
* Keybinds
#+begin_src emacs-lisp
(global-set-key (kbd "C-c C-l") 'org-store-link)
(global-set-key (kbd "C-c C-c") 'org-capture)
(global-set-key (kbd "C-d") 'org-agenda-day-view)
(global-set-key (kbd "C-w") 'org-agenda-week-view)
(global-set-key (kbd "C-c C-a") 'org-ql-search)
(global-set-key (kbd "C-x w") 'elfeed)
(global-set-key (kbd "C-c b") 'org-mark-ring-goto)
(global-set-key (kbd "C-c i") 'org-download-clipboard)
(global-set-key (kbd "C-c m") 'elfeed-tube-mpv)
(global-set-key (kbd "C-c C-g") 'consult-grep)
(global-set-key (kbd "C-.") 'embark-act)

;; unbinding embark
(map! :leader
      :desc "unmapping embark-act" "a" nil)

;; hydra
(map! :leader
 (:prefix "w"
  :desc "Hydra resize" :n "SPC" #'doom-window-resize-hydra/body))

(after! org
    (map! :leader
        :desc "toggle themes" "t t" #'my/my-toggle-theme)
    (map! :leader
        :desc "toggle themes" "t h" #'doric-themes-toggle)
    (map! :leader
        :desc "toggle themes" "t o" #'modus-themes-toggle)
    (map! :leader
        :desc "Variable Pitch mode" "p m" #'variable-pitch-mode)
    (map! :leader
        :desc "Olivetti mode" "o m" #'olivetti-mode)
    (map! :leader
        :desc "QL Agenda Search" "f a" #'org-ql-find-in-agenda)
    (map! :leader
        :desc "Consult find" "c l" #'consult-line)
    (map! :leader
        :desc "Org QL open link" "o l" #'org-ql-open-link)
    (map! :leader
        :desc "Org Agenda" "a" #'org-agenda))
#+end_src

#+RESULTS:
: org-agenda

* Emacs
** Registers
#+begin_src emacs-lisp
(set-register ?w (cons 'file "~/org/work-log.org"))
#+end_src
** Line Numbers
Removes line numbers from org files
#+begin_src emacs-lisp
(display-line-numbers-mode nil)
(add-hook 'org-mode-hook #'doom-disable-line-numbers-h)
(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode 0)))
#+end_src
** Fringe Mode
Removes the *~* from org files.
#+begin_src emacs-lisp
(setq vi-tilde-fringe-mode nil)
(remove-hook 'org-mode-hook #'vi-tilde-fringe-mode)
(add-hook 'org-mode-hook (lambda () (set-fringe-mode 0)))
#+end_src
** Diary
#+begin_src emacs-lisp
(setq org-agenda-include-diary t)
(setq diary-file "~/org/diary.org")
(setq calendar-view-diary-initially-flag t
      diary-number-of-entries 7
      diary-display-function #'diary-fancy-display)
(add-hook 'calendar-today-visible-hook 'calendar-mark-today)
#+end_src

** Ispell
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda ()
            (setq-local text-mode-ispell-word-completion t)))
#+end_src
** calendar
#+begin_src emacs-lisp
(setq calendar-date-style 'iso)
(setq calendar-mark-diary-entries-flag t)
(setq calendar-week-start-day 1)
#+end_src
* Other Packages
** Package Install
#+begin_src emacs-lisp :tangle /home/joonas/.config/doom/packages.el
(package! org-roam)
(package! org-roam-ui)
(package! org-super-agenda)
(package! color-theme-sanityinc-tomorrow)
(package! flatland-theme)
(package! org-modern)
(package! org-ql)
(package! org-timeblock)
(package! markdown-mode)
(package! elfeed-org)
(package! org-download)
(package! elfeed-tube)
(package! elfeed-tube-mpv)
(package! beacon)
(package! org-bullets)
(package! org-superstar)
(package! org-contrib)
(package! org-contacts)
(package! vertico)
(package! marginalia)
(package! ox-twbs)
(package! ef-themes)
(package! fontaine)
(package! spacemacs-theme)
(package! gruvbox-theme)
(package! zenburn-theme)
(package! hc-zenburn-theme)
(package! anti-zenburn-theme)
(package! consult-org-roam)
(package! org-inline-anim)
(package! org-inline-pdf)
(package! ox-hugo)
(package! ace-window)
(package! org-alert)
(package! olivetti)
(package! doric-themes)
(package! hydra)
(package! colorful-mode)
(package! notmuch)
(package! ob-mermaid)
(package! nix-mode)
(package! htmlize)
(package! lsp-mode)
(package! helm-org-ql)
(package! show-font)
(package! tmr)
(package! ewal)
(package! ewal-evil-cursors)
(package! ewal-spacemacs-themes)
(package! ewal-doom-themes)
(package! hyprlang-ts-mode)
#+end_src
** Consult
#+begin_src emacs-lisp
(use-package consult-org-roam
  :bind(("C-c o" . consult-org-roam-search ))
  )
#+end_src
** Org Download
*** Require
#+begin_src emacs-lisp
(require 'org-download)
#+end_src
** Elfeed
*** Require
#+begin_src emacs-lisp
;; (require 'elfeed)
#+end_src
*** Feeds
#+begin_src emacs-lisp
(setq elfeed-feeds
      '(("http://www.spc.noaa.gov/products/spcrss.xml" weather)
        "https://www.youtube.com/feeds/videos.xml?channel_id=UCcaTUtGzOiS4cqrgtcsHYWg"
        "https://www.youtube.com/feeds/videos.xml?channel_id=UC2eYFnH61tmytImy1mTYvhA"
        ("https://protesilaos.com/master.xml" protesilaoshttps://protesilaos.com/master.xml)))
#+end_src
*** elfeed-org
#+begin_src emacs-lisp
(use-package elfeed
	:defer t)
(use-package elfeed-org
  :after (elfeed)
  :config
  (elfeed-org)
  (setq elfeed-show-entry-switch 'display-buffer)
  (setq rmh-elfeed-org-files (list "~/org/elfeed.org")))
;; !! Change this to your elfeed.org file !!
#+end_src
*** Elfeed Tube and MPV
#+begin_src emacs-lisp
(use-package elfeed-tube
  :ensure t ;; or :straight t
  :after elfeed
  :demand t
  :config
  ;; (setq elfeed-tube-auto-save-p nil) ; default value
  ;; (setq elfeed-tube-auto-fetch-p t)  ; default value
  (elfeed-tube-setup)

  :bind (:map elfeed-show-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save)
         :map elfeed-search-mode-map
         ("F" . elfeed-tube-fetch)
         ([remap save-buffer] . elfeed-tube-save)))
(use-package elfeed-tube-mpv
  :ensure t ;; or :straight t
  :bind (:map elfeed-show-mode-map
              ("C-c C-f" . elfeed-tube-mpv-follow-mode)
              ("C-c C-w" . elfeed-tube-mpv-where)))

#+end_src
** Bullets
#+begin_src emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-mode t)
#+end_src
** Beacon
#+begin_src emacs-lisp
(setq beacon-mode 1)
#+end_src
** Contacts
#+begin_src emacs-lisp
(require 'org-contacts)
(setq org-contacts-files '("~/org/contacts.org"))
#+end_src
** Yas Snippet
#+begin_src emacs-lisp

#+end_src

** Newstickers
*** URL list
#+begin_src emacs-lisp
(setq newsticker-url-list
      '(("Proteslaos" "https://protesilaos.com/master.xml")))
#+end_src
