doom/.config/doom/packages.el
(package! org-roam)
(package! org-roam-ui)
(package! org-super-agenda)
(package! color-theme-sanityinc-tomorrow)
(package! flatland-theme)
(package! org-modern)
(package! org-ql)
(package! org-timeblock)
(package! markdown-mode)
(package! elfeed-org)
(package! org-download)
(package! elfeed-tube)
(package! elfeed-tube-mpv)
(package! beacon)
(package! org-bullets)
(package! org-superstar)
(package! org-contrib)
(package! org-contacts)
(package! vertico)
(package! marginalia)
(package! ox-twbs)
(package! ef-themes)
(package! fontaine)
(package! spacemacs-theme)
(package! gruvbox-theme)
(package! org-inline-pdf)
(package! zenburn-theme)
(package! hc-zenburn-theme)
(package! anti-zenburn-theme)
(package! consult-org-roam)
(package! org-inline-anim)
(package! org-inline-pdf)
(package! ox-hugo)
(package! ace-window)
(package! org-alert)
(package! olivetti)
(package! doric-themes)
(package! hydra)
(package! colorful-mode)
(package! notmuch)
(package! ob-mermaid)
