doom/.config/doom/config.org
*** Groups
#+begin_src emacs-lisp
(setq newsticker-groups
      `(("Emacs"
         ("Protesilaos"))))
#+end_src

** Ace Window
#+begin_src emacs-lisp
(use-package ace-window
  :init
  (setq aw-dispatch-always t)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :config
  (global-set-key (kbd "M-o") 'ace-window))
#+end_src
** org-alert
#+begin_src emacs-lisp
(require 'org-alert)
(setq alert-default-style 'libnotify)
(setq org-alert-interval 300)
(setq org-alert-notification-title "org alert")
(org-alert-enable)
#+end_src

** hyrda setup
#+begin_src emacs-lisp
(defhydra doom-window-resize-hydra (:hint nil)
  "
Resize window: _h_ left  _j_ down  _k_ up  _l_ right
"
  ("h" evil-window-decrease-width)
  ("j" evil-window-increase-height)
  ("k" evil-window-decrease-height)
  ("l" evil-window-increase-width)
  ("q" nil "quit"))

#+end_src
** colorful mode
#+begin_src emacs-lisp
(setq global-colorful-mode t)
(setq colorful-mode-major-mode t)
#+end_src
** ob-mermaid
#+begin_src emacs-lisp
(setq ob-mermaid-cli-path "/usr/bin/mmdc")
#+end_src
** collector
#+begin_src emacs-lisp
(require 'org-collector)
#+end_src
** ewal
#+begin_src emacs-lisp
(use-package ewal
  :init (setq ewal-use-built-in-always-p nil
              ewal-use-built-in-on-failure-p t
              ewal-built-in-palette "sexy-material"))
(use-package ewal-spacemacs-themes
  :init (progn
          (setq spacemacs-theme-underline-parens t
                my:rice:font (font-spec
                              :family "Source Code Pro"
                              :weight 'semi-bold
                              :size 11.0))
          (show-paren-mode +1)
          (global-hl-line-mode)
          (set-frame-font my:rice:font nil t)
          (add-to-list  'default-frame-alist
                        `(font . ,(font-xlfd-name my:rice:font))))
  :config (progn
            (load-theme 'ewal-spacemacs-modern t)
            (enable-theme 'ewal-spacemacs-modern)))
(use-package ewal-evil-cursors
  :after (ewal-spacemacs-themes)
  :config (ewal-evil-cursors-get-colors
           :apply t :spaceline t))
(use-package spaceline
  :after (ewal-evil-cursors winum)
  :init (setq powerline-default-separator nil)
  :config (spaceline-spacemacs-theme))
(setq ewal-json-file "~/.cache/wal/colors.json")
#+end_src

#+begin_src emacs-lisp
#+end_src
** hyprland
#+begin_src emacs-lisp
(add-to-list 'treesit-language-source-alist
        '(hyprlang "https://github.com/tree-sitter-grammars/tree-sitter-hyprlang"))
#+end_src
