doom/.config/doom/config.el

(setq newsticker-groups
      `(("Emacs"
         ("Protesilaos"))))

(use-package ace-window
  :init
  (setq aw-dispatch-always t)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :config
  (global-set-key (kbd "M-o") 'ace-window))

(require 'org-alert)
(setq alert-default-style 'libnotify)
(setq org-alert-interval 300)
(setq org-alert-notification-title "org alert")
(org-alert-enable)

(defhydra doom-window-resize-hydra (:hint nil)
  "
Resize window: _h_ left  _j_ down  _k_ up  _l_ right
"
  ("h" evil-window-decrease-width)
  ("j" evil-window-increase-height)
  ("k" evil-window-decrease-height)
  ("l" evil-window-increase-width)
  ("q" nil "quit"))

(setq global-colorful-mode t)
(setq colorful-mode-major-mode t)

(setq ob-mermaid-cli-path "/usr/bin/mmdc")

(require 'org-collector)
